Repository: SJM18/LtiAdvantage
Catalog: src/Resources/Localization.*.resx
Languages: hu

source: Test
hu: Teszt

# AboutLTITool
source: This is an LTI Advantage demonstration tool using .NET Core.
hu: Ez az eszköz az LTI Advantage demonstrálására készült .NET Core-al.

# ProjectBasedOn
source: The project is based on
hu: Ez az a következő projekten alapul

source: About
hu: Névjegy

# ToolSupports
source: This tool currently supports:
hu: Az eszköz a következő szabványokat támogatja:

source: Welcome Stranger!
hu: Üdv Idegen!

source: Please
hu: Kérlek

source: Register
hu: Regisztráció

source: or
hu: vagy

source: Sign In
hu: Bejelentkezés

# ToConfigure
source: to configure test Tools.
hu: az eszköz beállításához.

source: Welcome!
hu: Üdv!

source: Home
hu: Főoldal

source: Platforms
hu: Platformok

source: Videos
hu: Videók

source: Logout
hu: Kijelentkezés

# ToRegister
source: Register
hu: Regisztrálj

# ToLogin
source: Login
hu: Jelentkezz be

# CreateNewAccount
source: Create a new account.
hu: Új felhasználó létrehozása.

source: Getting Started
hu: Kezdő lépések

# UseThisToolWithPlatform
source: To use this Tool with your Platform
hu: Használd az Eszközt a Platformoddal

# ConfigurePlatformToLaunch
source: Configure your Platform to launch this Tool...
hu: Állítsd be a Platformod, hogy elindíthasd ezt az Eszközt...

# UsingOpenIdConnect
source: ..using this OpenID Connect Login Initiation Page
hu: ..a következő OpenID bejelentkezési oldal használatával

source: Registered Platforms
hu: Regisztrált Platformok

source: Issuer
hu: Aláíró

source: Display Name
hu: Megnevezés

source: Register your Platform
hu: Regisztráld a Platformod

# NoPlatformsRegistered
source: No platforms have been registered.
hu: Nincs Platform regisztrálva.

source: Register New Platform
hu: Új Platform regisztálása

source: Edit
hu: Módosítás

source: Details
hu: Részletek

source: Delete
hu: Törlés

source: Tool Settings
hu: Eszköz beállítások

source: Platform Settings
hu: Platform beállítások

source: Back to List
hu: Vissza a listához

source: Save
hu: Mentés

source: Platform Details
hu: Platform Részletek

# ToRecordOpenIdEndpointsAndCredentials
source: to record the platform's OpenID Connect endpoints, and the client credentials you want this tool to use.
hu: hogy beállíthasd a Open ID kapcsolódási végpontokat és a felhasználói azonosítókat amivel akarod használni ezt az Eszközt

source: JWK Set URL
hu: JWK gyűjtemény URL

source: Authorization URL
hu: Authorizációs URL

source: Access Token URL
hu: Elérési kulcs URL

# JwkSetUrlDescription
source: The tool can retrieve the platform's public keys using this endpoint.
hu: Az eszköz elérheti a platform publikus kulcsát ezen a végponton.

# IssuerDescription
source: This is the Issuer for all messages that originate from the Platform.
hu: Ez az Aláíró az összes üzenethez ami a Platformtól származik.

# AuthorizationUrlDescription
source: The tool requests the identity token from this endpoint.
hu: Az Eszköz ezen végpont segítéségével hitelesíti magát.

# AccessTokenUrlDescription
source: The tool can request an access token using this endpoint (for example to use the Names and Role Service).
hu: Az Eszköz ezen a végponton keresztül tud kulcsot igényelni (amivel például elérheti a Names and Role Service szolgáltatást).

source: Client ID
hu: Kliens ID

source: Deep Linking Launch URL
hu: Deep Linking indító URL

source: Launch URL
hu: Indító URL

source: Login URL
hu: Bejelentkező URL

source: Private Key
hu: Privát kulcs

# DeepLinkingLaunchUrlDescription
source: The URL to launch the tool's deep linking experience.
hu: Hivatkozás az Eszközön lévő Deep Linking technológia indításához.

# LaunchUrlDescription
source: The URL to launch the tool's resource link experience.
hu: Hivatkozás az Eszlöz erőforrásának indításához.

# LoginUrlDescription
source: The URL to initiate the tool's OpenID Connect third party login.
hu: Hivatkozás az Eszköz OpenID bejelentkezéséhez.

# PrivateKeyDescription
source: This is the private key the tool will use to sign client credentials.
hu: Ez a privát kulcs lesz használva az Eszköz általi az üzenetek aláírásához.

source: for development keys see
hu: fejlesztői kulcs generáláshoz használd a következő oldal

# PrivateKeyInPEMFormat
source: Enter the private key in PEM format.
hu: A privát kulcsot PEM formátumban kell megadni.

# PlatformRegister
source: Register Platform
hu: Platform létrehozása

source: Create
hu: Létrehozás

# PlatformDelete
source: Delete Platform
hu: Platform törlése
